'''
7
4 50
2 160
3 30
1 60
3 20
1 100

1 60
1 100
2 160
3 20
3 30
4 50

([1,2] 에서 MAX * [3,4] 에서 MAX - [1,2] 에서 MIN * [3,4] 에서 MIN )* K 

동쪽은 1, 서쪽은 2, 남쪽은 3, 북쪽은 4

          50 
   + - - - - - - - +
10 |...............|
   + - - +.........|_ _ _ _ _ _ _ _
      10 |........./..........@/.../
      10 |.........|---------------
         + - - - - +
             40 

4 40
2 50
3 10
1 10
4 10
1 40 


오른쪽 1, 왼쪽 2, 아래 3, 위 4 

             80
+--------------------------+
|                 40       | 10 
| 20        +--------------+
|           | 10
+-----------+
    40

4 10
2 80
3 20
1 40
4 10
1 40

1
1 40
4 10
1 40
4 10
2 80
3 20


오른쪽 1, 왼쪽 2, 아래 3, 위 4 

1
2 50
3 100
1 30
3 60
1 20
4 160

'''
k = int(input())
L = []
R = []
for i in range(6):
    a,b = map(int,input().split())
    if a == 1 or a==2: L.append(b)
    else : R.append(b)

print(L,R)
A = max(L)*max(R)
print(A)
#   0   1   2    0   1    2 
# [50, 30, 20] [100, 60, 160]
# 최대 변 길이와 인접한 두 변을 제거 하는 코드
# 

if max(L) > max(R):
   k = L.index(max(L))

   R[k] = 0
   L[k] = 0
   if k+1 > 2:
       R[0] = 0
       L[0] = 0
   else: 
      R[k+1] = 0
      L[k+1] = 0 
else:
   k = R.index(max(R))
   L[k] = 0
   R[k] = 0
   if k+1 > 2: 
      L[0] = 0
      R[0] = 0
   else: 
      L[k+1] = 0
      R[k+1] = 0
print(L,R)
B = max(L)*max(R)
print(A-B)